trlafleur/Acurite-0986TX-Decoder-ESP32a/Acurite_00986TX_Decoder_ESP32a.ino

/**********************************************************************
 * Arduino code to decode the Acurite 0986TX wireless temperature sensor
 *
 * The 0986TX wireless temperature probe contains a 433.92 MHz
 *  wireless transmitter. The temperature from the sensor is
 *  sent approximately every 120 seconds. Their are two sensor
 *  1R is for refrigerator, 2F is for freezer
 *
 * The 0986TX sends a block of data, 4 SYNC pulse + a DATA stream
 *  per temperature reading. Sometimes its sends one block of data,
 *  at other time its send two block. Their seems to be a bug in
 *  the device when it sends the 2nd block. (The last bit is NOT sent
 *  correctly if the last bit of the CRC is a 1. So for now we don’t
 *  decode the 2nd message.)
 *
 * The sensor then sends 4 data sync pulses of approximately 50% 
 *  duty cycle. The sync pulses start with a 
 *  high level and continue for 4 high / low pulses.
 *
 * The data bits immediately follow the fourth low of the data
 *  sync pulses. 
 *
 * 1 bit ~900us low, preceded by a ~200us high pre pulse
 * 0 bit ~500us low, preceded by a ~200us high pre pulse
 *
 * 4 sync pulse, followed by 40 bits of data
 * 
 * 5 bytes block, sent once or twice, with a single short pulse between blocks
 *
 * Data is TX'ed in OOK/AM/CW on-off-keying format, a 1 = low, 0 = high or TX on
 * 
 * Data Format - 5 bytes, sent LSB first!
 *
 * TT ID ID SS CC
 *
 * T  - Temperature in Fahrenheit, integer, MSB = sign.
 *      Encoding is "Sign and magnitude"
 * ID - 16 bit sensor ID
 *      changes at each sensor power up
 * S  - status/sensor type
 *       0x00 = Sensor 1       refrigerator
 *       0x01 = Sensor 2       freezer
 *       0x02 = low battery
 * C  = CRC (CRC-8 poly 0x07, little-endian)
 * 
 * The code below works by receiving a level change interrupt 
 *  on each changing edge of the data stream from the RF module
 *  and recording the time in uSec between each edge.
 *
 * 8 measured hi and lo pulses in a row, 4 high and 4 low, of 
 *  approximately 1500 uSec each constitute a sync stream.
 *
 * The remaining 40 bits of data, or 80 edges, are measured
 *  and converted to 1s and 0s by checking the high to low
 *  pulse times. Noise is removed if pulse are too short, or 
 *  too long
 *
 * As a note: often the 1st sync pulse high is ~2300us long, last one is
 *  ~1300us long.
 *  
 *  Temperature is sent to MQTT server if using a ESP32 or ESP8266 processor
 *  
 *  MQTT
 *    A message sent to this device by topic: SUBSCRIBE_TOPIC, with a "R"
 *     in the 1st byte will reset all Min/Max settings
 *     
 *  MQTT Data Sent:
 *    Temperature, Min, Max and Battery Status for both devices
 *    Alarms for over-temperature and Low Battery
 *    
 *  Integration time for alarms can be set for each sensor.     
 *  
 *  Radio:
 *   Using an RXB6 or equivalent, connect to 3.3v, gnd and connect dataout
 *    to interrupt pin on CPU.
 *    
 *   RFM69 connect DIO-2 to interrupt pin on CPU.
 *    
 *   Antenna is 17.2cm long at 433MHz
 *  
 * *********************************************************************
 * Ideas on decoding protocol and prototype code from
 * Ray Wang (Rayshobby LLC) http://rayshobby.net/?p=8998
 *
 * Code based on Ray Wang's humidity _display.ino source.
 *
 * *********************************************************************
 * 
 CHANGE LOG:
 *
 *  DATE         REV  DESCRIPTION
 *  -----------  ---  ----------------------------------------------------------
 *  04-Apr-2018 1.0a  TRL - First Build
 *  05-Apr-2018 1.0b  TRL - Added support for RFM69-433Mhz receiver
 *  07-Apr-2018 1.0c  TRL - Added support for ESP32 and MQTT
 *  08-Apr-2018 1.0d  TRL - Added Min/Max reporting and resetting via MQTT
 *  10-Apr-2018 1.0e  TRL - Added E-Mail support
 *  
 *  
 *  Notes:  1)  Tested with Arduino 1.8.5
 *          2)  Testing using Moteino Mega Rev4 with 433Mhz RFM69 
 *                RFM69OOK lib from https://github.com/kobuki/RFM69OOK
 *                DIO2 connected to pin interrupt pin.
 *          3)  Tested with a RXB6 receiver connected to interrupt pin.
 *          4)  Tested using a TTGO R1 ESP32 module
 *          5)  ESP32 amd ESP8266 supports sending data via MQTT or E-Mail
 *          6)  ESP8266 tested with a NodeMCU 1.0
 *          7)  Added E-mail-SMS Support NOTE: you must edit Gsender.h with your info
 *          8)  
 *          
 *  Todo:   1) Fix issues with RFM69 receiver, work in progress, not working
 *          2) Move MyDebug define's inside processor type
 *          3) 
 *          4) 
 *          5) 
 * 
 * Tom Lafleur --> tom@lafleur.us
 * 
 */

 /* ************************************************************* */

//#define RFM69
#define VERBOSE_OUTPUT
//#define DISPLAY_BIT_TIMING
//#define DISPLAY_DATA_BYTES
#define MyDEBUG
#define IF_MQTT
#define IF_EMAIL

#ifdef RFM69
  #include <RFM69OOK.h>
  #include <SPI.h>
  #include <RFM69OOKregisters.h>
  RFM69OOK radio;
#endif

// Ring buffer size has to be large enough to fit
// data and sync signal, at least 2x the number of bit we expect
// so 44 * 2 = 88,  round up to a power of 2, --> 128 for now
#define RING_BUFFER_SIZE  128

#define SYNC_HIGH             1700          // Sync high time
#define SYNC_LOW              1400          // Sync low time (last sync pulse is ~1300us)
#define SYNC_TOLL             650           // +- Tolerance for sync timming

#define PULSE_BIT1            900           // Bit 1 time in us
#define PULSE_BIT0            550           // Bit 0 time in us
#define PULSE_TOLL            100           // +- Tolerance for bit timming
#define PRE_PULSE             200           // On pulse prior to data

#define PULSE_SHORT_NOISE     PRE_PULSE-50            // anything shorter that this is noise, Pre pulse is ~200US
#define PULSE_LONG_NOISE      SYNC_HIGH+SYNC_TOLL+1   // anything longer that this is noise


// On the arduino connect the data pin, the pin that will be 
// toggling with the incomming data from the RF module, to
// digital pin 10. Pin D10 is interrupt 0 and can be configured
// for interrupt on change, change to high or low.

// The squelch pin in an input to the radio that squelches, or
// blanks the incoming data stream. Use the squelch pin to 
// stop the data stream and prevent interrupts between the 
// data packets if desired. (not used at this time)



#include <Arduino.h>

