trlafleur/Acurite-0986TX-Decoder-ESP32a/Acurite_00986TX_Decoder_ESP32a.ino
/* ************************************************************* */
// Select processor includes
#ifdef ARDUINO_ARCH_ESP32
  #include <WiFi.h>
  #include <esp_wps.h>
  #include "Gsender.h"
  #include <WiFiClientSecure.h>
  #include "MovingAverage.h"
#endif
#ifdef ARDUINO_ARCH_ESP8266
  #include <ESP8266WiFi.h>
  #include "Gsender.h"
  #include <WiFiClientSecure.h>
  #include "MovingAverage.h"
#endif

#if defined  (ARDUINO_ARCH_ESP32) || defined (ARDUINO_ARCH_ESP8266)       // ESP32 TTgo V1

 // create an instance of WiFi client 
  WiFiClient espClient;


#pragma region Globals
  // WiFi information
  // change it with your ssid-password
  const char* ssid = "MySSID";                            // <----------- Change This
  const char* password = "MyPass";                        // <----------- Change This
#ifdef IF_EMAIL
  const char* MySendToAddress = "yourEmailAddress";       // <----------- Change This for E-Mail
#endif
  uint8_t connection_state = 0;                    // Connected to WIFI or not
  uint16_t reconnect_interval = 10000;             // If not connected wait time to try again
#pragma endregion Globals
  
  #ifdef IF_MQTT
   #include <PubSubClient.h>
   
    // MQTT Server IP Address or FQDN
    const char* mqtt_server = "192.168.167.32";    // <----------- Change This
  
    // create an instance of PubSubClient client 
    PubSubClient client(espClient);
    
    // My topics
    #define RTEMP_TOPIC     "RSF/REF/Temp"                                              // <----------- Change These as needed
    #define FTEMP_TOPIC     "RSF/FRZ/Temp"
    #define RBATT_TOPIC     "RSF/REF/BATT"
    #define FBATT_TOPIC     "RSF/FRZ/BATT"
    #define RALARM_TOPIC    "RSF/REF/ALARM"
    #define FALARM_TOPIC    "RSF/FRZ/ALARM"
    #define BALARM_TOPIC    "RSF/BATT/ALARM"
    #define RMIN_TOPIC      "RSF/REF/MIN"
    #define RMAX_TOPIC      "RSF/REF/MAX"
    #define FMIN_TOPIC      "RSF/FRZ/MIN"
    #define FMAX_TOPIC      "RSF/FRZ/MAX"
    #define SUBSCRIBE_TOPIC "RSF/REF/RESET"
  #endif    // End of: #ifdef IF_MQTT

  
  MovingAverage <int> REF (10);       // create a moving average over last n values   // <----------- Change This as needed
  MovingAverage <int> FRZ (10);       // 10 * 120 sec = 1200sec = 20min
  
  #define MAX_RTEMP     40            // Max temperature for refrigerator             // <----------- Change This as needed
  #define MAX_FTEMP     25            // Max temperature for freezer
  
  #define AlarmTimeToWait          120L            // Wait this amount of time for next alarm message, in Minutes  // <----------- Change These as needed
  #define BattAlarmTimeToWait     1440L            // Wait this amount of time for next alarm message, in Minutes
  
  unsigned long LastTimeRef  = 0;
  unsigned long LastTimeFrz  = 0;
  unsigned long LastTimeBatt = 0;
  bool R_Flag = false;
  bool F_Flag = false;
  bool B_Flag = false;
     
  unsigned long currentMillis = 0;            // a 1 Minute clock timer
  unsigned long interval = 60000;             // = 60 sec --> 1 Minure
  unsigned long previousMillis = 0;
  unsigned long Minute = 0;
  
  unsigned long BlockFailCounter  = 0;
  unsigned long CRCFailCounter    = 0;
  
  char msg[50];                               // char string buffer
  
  //portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;    // <------------------------------------- esp32 only
  /* pin that is attached to interrupt */
  #define DATAPIN          12                 // interrupt pin
  byte interruptPin = DATAPIN;
  #define MyInterrupt (digitalPinToInterrupt(interruptPin))
  
  #define SQUELCHPIN       4                  // option for some receivers
  
  #define MyLED            2
  
  // define below are use in debug as trigers to logic analyzer
  #define MySync            15                // Trigger on Sync found
  #define MyBit             13                // Trigger on bit edge
  #define MyFrame           14                // Trigger at end of frame

/* ************************************************************* */
#elif __AVR_ATmega1284P__      // MoteinoMega LoRa

  #define DATAPIN          10                // D10 is interrupt 0 on a Moteino Mega
  #define MyInterrupt       0
  #define SQUELCHPIN        4
  
  #define MyLED            15
  
  // define below are use in debug as trigers to logic analyzer
  #define MySync            12                // Trigger on Sync found
  #define MyBit             13                // Trigger on bit edge
  #define MyFrame           14                // Trigger at end of frame

/* ************************************************************* */

#elif ARDUINO_ARCH_ESP8266
  #Warning Processor is a  ESP8266
#else
  #error CPU undefined.....
#endif


 /* ************************************************************* */
#define SYNCPULSECNT      4                   // 4 sync pulses (8 edges)
#define SYNCPULSEEDGES    (SYNCPULSECNT *2 )

#define DATABYTESCNT      5                   // Number of bytes to look for 
#define DATABITSCNT       (DATABYTESCNT * 8)  // Number of bits to look for
#define DATABITSEDGES     (DATABITSCNT * 2)   // Number of edges to look for


// The pulse durations are measured in micro seconds between
// pulse edges.
unsigned long pulseDurations[RING_BUFFER_SIZE];   // where we store the pulse edges
unsigned int syncIndex  = 0;                // index of the last bit time of the sync signal
unsigned int dataIndex  = 0;                // index of the first bit time of the data bits (syncIndex+1)
bool         syncFound = false;             // true if sync pulses found
bool         received  = false;             // true if enough sync pulses bits are found
unsigned int changeCount = 0;               // Count of pulses edges

unsigned char dataBytes[DATABYTESCNT];      // Decoded data storage
unsigned long mytime = 0;                   // event time
signed char temp = 0;                       // temperature in deg F
int RMinTemp = 127;                         // Max temp is 127deg
int RMaxTemp = 0;
int FMinTemp = 127;                         // Max temp is 127deg
int FMaxTemp = 0;


#if defined  (ARDUINO_ARCH_ESP32) || defined (ARDUINO_ARCH_ESP8266)
#ifdef IF_MQTT
   /* ************************************************************* */
  void receivedCallback(char* topic, byte* payload, unsigned int length) 
  {
    Serial.println("Message received: ");
    Serial.println(topic);
  
    Serial.print("payload: ");
    for (int i = 0; i < length; i++) 
    {
      Serial.print((char)payload[i]);
    }
    Serial.println();
    if ((char)payload[0] == 'R') 
    {
      RMinTemp = 127;
      RMaxTemp = 0;
      FMinTemp = 127;
      FMaxTemp = 0;
    }
  }


