trlafleur/Acurite-0986TX-Decoder-ESP32a/Acurite_00986TX_Decoder_ESP32a.ino
   /* ************************************************************* */
  void mqttconnect() 
  {
    /* Loop until reconnected */
    while (!client.connected()) 
    {
      Serial.println();
      Serial.println("MQTT connecting ...");
      
      /* client ID */
   //   String clientId = "ESP32_REF_Client"; 
        String clientId = WiFi.macAddress();                // use our MAC address as MQTT Client ID
   
      /* connect now */
      if (client.connect(clientId.c_str()))                  
      {
        Serial.print("MQTT connected, Client ID: ");
        Serial.println(clientId);
        /* subscribe topic with default QoS 0*/
       client.subscribe(SUBSCRIBE_TOPIC);
      } else 
      {
        Serial.print("failed, status code =");
        Serial.print(client.state());
        Serial.println("try again in 5 seconds");
        /* Wait 5 seconds before retrying */
        delay(5000);
      }
    }   // End of: while (!client.connected()) 
  }   // End of:  mqttconnect() 

#endif    // End of: IF_MQTT


/* ************************************************************* */
uint8_t WiFiConnect(const char* nSSID = nullptr, const char* nPassword = nullptr)
{
   static uint16_t attempt = 0;
   Serial.print("Connecting to ");
   if(nSSID) {
       WiFi.begin(nSSID, nPassword);  
       Serial.println(nSSID);
   } else {
       WiFi.begin(ssid, password);
       Serial.println(ssid);
   }

   uint8_t i = 0;
   while(WiFi.status()!= WL_CONNECTED && i++ < 50)
   {
       delay(200);
       Serial.print(".");
   }
   ++attempt;
   Serial.println("");
   if(i == 51) {
       Serial.print("Connection: TIMEOUT on attempt: ");
       Serial.println(attempt);
       if(attempt % 2 == 0)
           Serial.println("Check if access point available or SSID and Password\r\n");
       return false;
   }
   Serial.println("Connection: ESTABLISHED");
   Serial.print("Got IP address: ");
   Serial.println(WiFi.localIP());
   return true;
}

/* ************************************************************* */
void Awaits()
{
   uint32_t ts = millis();
   while(!connection_state)
   {
       delay(200);
       if(millis() > (ts + reconnect_interval) && !connection_state){
           connection_state = WiFiConnect();
           ts = millis();
       }
   }
}

#endif    // End of: #if defined  (ARDUINO_ARCH_ESP32)....


 /* ************************************************************* */
 /*
 * code to print formatted hex 
 */
void PrintHex8(uint8_t *data, uint8_t length) // prints 8-bit data in hex
{
   char tmp[length*2+1];
   byte first;
   int j = 0;
   for (uint8_t i = 0; i < length; i++) 
     {
       first = (data[i] >> 4) | 48;
       if (first > 57) tmp[j] = first + (byte)39;
       else tmp[j] = first ;
       j++;
    
       first = (data[i] & 0x0F) | 48;
       if (first > 57) tmp[j] = first + (byte)39; 
       else tmp[j] = first;
       j++;
     }
   tmp[length*2] = 0;
   Serial.print("0X");
   Serial.print(tmp);
}


/* ************************************************************* */
// reverses all bits in a byte
uint8_t reverse8(uint8_t x) 
{
    x = (x & 0xF0) >> 4 | (x & 0x0F) << 4;
    x = (x & 0xCC) >> 2 | (x & 0x33) << 2;
    x = (x & 0xAA) >> 1 | (x & 0x55) << 1;
    return x;
}

/* ************************************************************* */
// CRC8 for little endian format
uint8_t crc8le(uint8_t const message[], unsigned nBytes, uint8_t polynomial, uint8_t init) 
{
    uint8_t crc = init, i;
    unsigned byte;
    uint8_t bit;
    
    for (byte = 0; byte < nBytes; ++byte) 
    {
      for (i = 0x01; i & 0xff; i <<= 1) 
        {
            bit = (crc & 0x80) == 0x80;
            if (message[byte] & i) 
            {
              bit = !bit;
            }
              crc <<= 1;
              if (bit) {
              crc ^= polynomial;
            }
        }
    crc &= 0xff;
    }
    return reverse8(crc);
}

/* ************************************************************* */
/*
 * Look for the sync pulse train, 4 high-low pulses of
 * 1600uS high and 1500uS low.
 * idx is index of last captured bit duration.
 * Search backwards 8 times looking for 4 pulses
 * approximately 1600 uS long.
 */
bool isSync(unsigned int idx) 
{
   // check if we've received 4 sync pulses of correct timing
   for( int i = 0; i < SYNCPULSEEDGES; i += 2 )
   {
      unsigned long t1 = pulseDurations[(idx+RING_BUFFER_SIZE-i) % RING_BUFFER_SIZE];
      unsigned long t0 = pulseDurations[(idx+RING_BUFFER_SIZE-i-1) % RING_BUFFER_SIZE];    
      
      // if any of the preceeding 8 pulses are out of bounds, short or long,
      // return false, no sync found
      if( t0 < (SYNC_HIGH-SYNC_TOLL) || t0 > (SYNC_HIGH+SYNC_TOLL) ||
          t1 < (SYNC_LOW-SYNC_TOLL)  || t1 > (SYNC_LOW+SYNC_TOLL) )
      {
         return false;
      }
   }
   return true;
}


/* ************************************************************* */
/* Interrupt  handler 
 * Tied to pin 10 INT0 of Moteino Mega
 * Set to interrupt on edge (level change) high or low transition.
 * Change the state of the Arduino LED on each interrupt. 
 */
void interrupt_handler() 
{
   volatile static unsigned long duration = 0;
   volatile static unsigned long lastTime = 0;
   volatile static unsigned int ringIndex = 0;
   volatile static unsigned int syncCount = 0;
   volatile static unsigned int bitState  = 0;

   // Ignore if we haven't finished processing the previous 
   // received signal in the main loop.
   if( received == true ) {return;}

   bitState = digitalRead(DATAPIN);
   digitalWrite(MyLED, bitState);         // LED to show receiver activity

   // calculating timing since last change
   long time = micros();
   duration = time - lastTime;
   lastTime = time;

   // Known errors in bit stream is are runt/short and long pulses.
   // If we ever get a really short, or really long 
   // pulse's we know there is an error in the bit stream
   // and should start over.
   if ( (duration > (PULSE_LONG_NOISE)) || (duration < (PULSE_SHORT_NOISE)) )    // This must be noise...  
   {
      received = false;
      syncFound = false;
      changeCount = 0;                          // restart, start looking for data bits again
   }

