trlafleur/Acurite-0986TX-Decoder-ESP32a/Acurite_00986TX_Decoder_ESP32a.ino
   // if we have good data, store data in ring buffer
   ringIndex = (ringIndex + 1) % RING_BUFFER_SIZE;
   pulseDurations[ringIndex] = duration;
   changeCount++;                               // found another edge

#ifdef MyDEBUG
      digitalWrite (MyBit, HIGH);          
      delayMicroseconds (1);
      digitalWrite (MyBit, LOW);
#endif

   // detected sync signal
   if( isSync (ringIndex) )                       // check for sync
   {
      syncFound = true;
      changeCount = 0;                            // lets restart looking for data bits again
      syncIndex = ringIndex;
      dataIndex = (syncIndex + 1) % RING_BUFFER_SIZE;

#ifdef MyDEBUG
      digitalWrite (MySync, HIGH);          
      delayMicroseconds (1);
      digitalWrite (MySync, LOW);
#endif
     
    }

   // If a sync has been found, then start looking for the
   //  data bit edges in DATABITSEDGES
   if( syncFound )
   {       
      // not enough bits yet, so no full message has been received yet
      if( changeCount < DATABITSEDGES )            
        { received = false; }
      
      else 
      
      if( changeCount >= DATABITSEDGES )            // check for too many bits
        {      
          changeCount = DATABITSEDGES;              // lets keep bits we have, CRC will kill if bad
          detachInterrupt(MyInterrupt);             // disable interrupt to avoid new data corrupting the buffer
          received = true;   
        }
           
#ifdef MyDEBUG 
        digitalWrite (MyFrame, HIGH); 
        delayMicroseconds (100);
        digitalWrite (MyFrame, LOW);
#endif  
      

    }    // end of if syncFound
}    // end of interrupt_handler





/* ************************************************************* */
/* ************************************************************* */
/* ************************************************************* */
void setup()
{
   Serial.begin(115200);
   delay(2000);
   Serial.println("");
   Serial.print("Started Acu-rite 0986 Decoder, ");
#ifdef RFM69
    Serial.println("RFM69");
#else
   Serial.println("External Receiver");
#endif

   pinMode(DATAPIN, INPUT);             // data interrupt pin set for input
   pinMode(MyLED, OUTPUT);              // LED output

   pinMode(SQUELCHPIN, OUTPUT);         // data squelch pin on radio module
   digitalWrite(SQUELCHPIN, HIGH);      // UN-squelch data

#ifdef MyDEBUG
   pinMode(MySync, OUTPUT);              // sync bit output
   digitalWrite (MySync, LOW);
   
   pinMode(MyBit, OUTPUT);               // data bit output
   digitalWrite (MyBit, LOW);
   
   pinMode(MyFrame, OUTPUT);             // end of frame bit output
   digitalWrite (MyFrame, LOW);
#endif


#if defined  (ARDUINO_ARCH_ESP32) || defined (ARDUINO_ARCH_ESP8266)       // ESP32 TTgo V1
#ifdef RFM69
    pinMode( 14, INPUT);        // RFM69 RST
    //digitalWrite (14, LOW);
    pinMode(26, INPUT);         // DIO-0
    pinMode(33, INPUT);         // DIO-1
    pinMode(32, INPUT);         // DIO-2  This is where we get the RX data --> comnnected to INT-0
    radio.initialize();
    //radio.setBandwidth(OOK_BW_10_4);
    radio.setRSSIThreshold(-70);
    radio.setFixedThreshold(20);
    radio.setSensitivityBoost(SENSITIVITY_BOOST_HIGH);
    radio.setFrequencyMHz(433.92);
    radio.receiveBegin();
#endif

// Setup WiFi
// WiFi.config(ip, dns, gateway, subnet);

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);

  connection_state = WiFiConnect();
  if(!connection_state)                     // if not connected to WIFI
       Awaits();                            // constantly trying to connect

//  while (WiFi.status() != WL_CONNECTED) 
//  {
//    delay(500);
//    Serial.print(".");
//    //esp_wifi_wps_start(0);
//  }

    delay (1000);

#ifdef IF_MQTT
  /* configure the MQTT server with IPaddress and port */
  client.setServer(mqtt_server, 1883);
  /* this receivedCallback function will be invoked 
  when client received subscribed topic */
  client.setCallback(receivedCallback);
#endif    // End of: #ifdef IF_MQTT

#elif __AVR_ATmega1284P__      // Moteino Mega LoRa
#ifdef RFM69
  pinMode( 3, INPUT);         // RFM69 RST
  //digitalWrite (3, LOW);
  pinMode( 2, INPUT);         // DIO-0
  pinMode(22, INPUT);         // DIO-1
  pinMode(21, INPUT);         // DIO-2  This is where we get the RX data --> comnnected to INT-0
  radio.initialize();
  //radio.setBandwidth(OOK_BW_10_4);
  radio.setRSSIThreshold(-70);
  radio.setFixedThreshold(20);
  radio.setSensitivityBoost(SENSITIVITY_BOOST_HIGH);
  radio.setFrequencyMHz(433.92);
  radio.receiveBegin();
#endif    // End of: RFM69

#endif

   pinMode(MyInterrupt, INPUT_PULLUP);
   attachInterrupt(MyInterrupt, interrupt_handler, CHANGE);
   
}   // end of setup


/* ************************************************************* */
/*
 * Convert pulse durations to bits.
 * 
 */
int convertTimingToBit(unsigned int t0, unsigned int t1) 
{
   if( t1 > (PULSE_BIT1-PULSE_TOLL) && t1 < (PULSE_BIT1+PULSE_TOLL) )
    { return 1; }

   else if ( t1 > (PULSE_BIT0-PULSE_TOLL) && t1 < (PULSE_BIT0+PULSE_TOLL) )
    { return 0; }
   
   return -1;                   // error, if undefined bit timimg
}


#if defined  (ARDUINO_ARCH_ESP32) || defined (ARDUINO_ARCH_ESP8266)  

/* ************************************************************* */
// 0986TX send's a meassge every ~120 sec, so lets average temperature
// over a number of sample, if is greater that our alarm settings, we need to send
// an alarm, but only once every so many minutes.

void MaxRefrigeratorAlarm (int temp)
{ 
  if (R_Flag == false)                         // see if this is 1st time here for this alarm...
   {
#ifdef IF_MQTT      
      snprintf (msg, 6, "%d", temp);
      client.publish (RALARM_TOPIC, msg);
#endif
#ifdef IF_EMAIL
     Gsender *gsender = Gsender::Instance();    // Getting pointer to class instance
     String subject = "RSF Refrigerator Alarm!";
     snprintf (msg, 50, "Temperature is: %d", temp);
     if(gsender->Subject(subject)->Send(MySendToAddress, msg)) {
         Serial.println("E-mail Message E-mail send.");
     } else {
         Serial.print("Error sending message: ");
         Serial.println(gsender->getError());
     }

#endif
      Serial.println ("Refrigerator Alarm"); 
          
