trlafleur/Acurite-0986TX-Decoder-ESP32a/Acurite_00986TX_Decoder_ESP32a.ino
      R_Flag = true;
      LastTimeRef = Minute;                   // save the current time
   }
  else
  {
    if ( Minute >= (LastTimeRef + AlarmTimeToWait ) )       // see if it time to re-send alarm
      { R_Flag = false; }                                   // Yes, reset alarm flag
  }
}


/* ************************************************************* */
void MaxFreezerAlarm(int temp)
{
  if (F_Flag == false)                         // see if this is 1st time here for this alarm...
   {
#ifdef IF_MQTT
      snprintf (msg, 6, "%d", temp);
      client.publish (FALARM_TOPIC, msg);
#endif

#ifdef IF_EMAIL
     Gsender *gsender = Gsender::Instance();    // Getting pointer to class instance
     String subject = "RSF Freezer Alarm!";
     snprintf (msg, 50, "Temperature is: %d", temp);
     if(gsender->Subject(subject)->Send("lafleur@lafleur.us", msg)) {
         Serial.println("E-Mail Message send.");
     } else {
         Serial.print("Error sending E-Mail message: ");
         Serial.println(gsender->getError());
     }

#endif
      Serial.println ("Freezer Alarm");    
      F_Flag = true;
      LastTimeFrz = Minute;                    // save the current time
   }
  else
  {
    if ( Minute >= (LastTimeFrz + AlarmTimeToWait ) )       // see if it time to re-send alarm
      { F_Flag = false; }                                   // Yes, reset alarm flag
  }
}


/* ************************************************************* */
void BatteryLowAlarm (int device)
{
  if (B_Flag == false)                         // see if this is 1st time here for this alarm...
   {
      if (device == 1) {
        snprintf (msg, 50, "Battery Low, Refrigerator Sensor: %d", device);
        Serial.println ("Battery Low Alarm 1R");  
      }
      if (device == 2) {
        snprintf (msg, 50, "Battery Low, Frezzer Sensor: %d", device);
        Serial.println ("Battery Low Alarm 2F");  
      }
#ifdef IF_MQTT
      client.publish (BALARM_TOPIC, msg);
#endif
#ifdef IF_EMAIL
     Gsender *gsender = Gsender::Instance();    // Getting pointer to class instance
     String subject = "RSF Low Battery Alarm!";
     if(gsender->Subject(subject)->Send("lafleur@lafleur.us", msg)) {
         Serial.println("E-Mail Message send.");
     } else {
         Serial.print("Error sending E-Mail message: ");
         Serial.println(gsender->getError());
     }
#endif
      B_Flag = true;
      LastTimeBatt = Minute;                    // save the current time
   }
  else
  {
    if ( Minute >= (LastTimeBatt + BattAlarmTimeToWait ) )  // see if it time to re-send alarm
          { B_Flag = false; }                               // Yes, reset alarm flag
  }
}

/* ************************************************************* */
void MQTT_Send (void)
{
#ifdef IF_MQTT
// send sensor number, 1R or 2R temperature and battery status, and alarm status to MQTT server

          // get temperature, -temperature is in Sign and magnitude format
          if (dataBytes[0] >= 128) { temp =  (~dataBytes[0] & 0x7f); temp = (temp | 0x80) + 1; }
          else { temp =  dataBytes[0]; }
          snprintf (msg, 6, "%d", temp);
              
          if ( dataBytes[3] & 0x01)                                       // Sensor 2, Frezzer
             { 
              client.publish (FTEMP_TOPIC, msg);                          // send temperature

              if (temp > FMaxTemp) {FMaxTemp = temp;}
              if (temp < FMinTemp) {FMinTemp = temp;}
              
              snprintf (msg, 6, "%d", FMinTemp);
              client.publish (FMIN_TOPIC, msg);                           // send min temperature              
              snprintf (msg, 6, "%d", FMaxTemp);
              client.publish (FMAX_TOPIC, msg);                           // send max temperature 
                            
              if ( (dataBytes[3] & 0x02) == 0x02) 
                {
                  client.publish (FBATT_TOPIC, "Low Battery 2F");
                  BatteryLowAlarm ( 2 );
                }
              
              int Frz_Temp = FRZ.CalculateMovingAverage((int) temp);
              if (Frz_Temp >= MAX_FTEMP) { MaxFreezerAlarm(Frz_Temp); }   // do we have an alarm? Yes
              else { F_Flag = false; }    // no alarm now
              }
          else                                                           // Sensor 1, Refrigerator 
             { 
              client.publish (RTEMP_TOPIC, msg);
              
              if (temp > RMaxTemp) {RMaxTemp = temp;}
              if (temp < RMinTemp) {RMinTemp = temp;}
              
              snprintf (msg, 6, "%d", RMinTemp);
              client.publish (RMIN_TOPIC, msg);                           // send min temperature              
              snprintf (msg, 6, "%d", RMaxTemp);
              client.publish (RMAX_TOPIC, msg);                           // send max temperature               
              
              if (dataBytes[3] & 0x02 == 0x02) 
                {
                  client.publish (RBATT_TOPIC, "Low Battery 1R");
                  BatteryLowAlarm ( 1 );
                }
              int Ref_Temp = REF.CalculateMovingAverage((int) temp);
              if (Ref_Temp >= MAX_RTEMP)  { MaxRefrigeratorAlarm(Ref_Temp); }
              else { R_Flag = false; }   // no alarm now
              }   
#endif
}   // End of MQTTSend



#endif    // end of: #if defined  (ARDUINO_ARCH_ESP32)...


/* ************************************************************* */
/* ************************************************************* */
/* ************************************************************* */
/*
 * Main Loop
 * Wait for received to be true, meaning a sync stream plus
 * all of the data bit edges have been found.
 * Convert all of the pulse timings to bits and calculate
 * the results.
 */
void loop()
{

#if defined  (ARDUINO_ARCH_ESP32) || defined (ARDUINO_ARCH_ESP8266)
#ifdef IF_MQTT 
  /* if client was disconnected then try to reconnect again */
   if (!client.connected()) {
     mqttconnect();
   }
  /* this function will listen for incomming 
  subscribed topic-process-invoke receivedCallback */
   client.loop();
#endif  
#endif    // end of defined  (ARDUINO_ARCH_ESP32)....

// lets setup a long duration timer at 1 minute tick
  currentMillis = millis ();                                  // get current time
  if (currentMillis - previousMillis >= interval)
        {previousMillis = currentMillis; Minute++;}           // add one to minute couter if time..

 
   if( received == true )                                     // check to see if we have a full block of bits to decode
   {
      // disable interrupt to avoid new data corrupting the buffer
      detachInterrupt(MyInterrupt);
      
