trlafleur/Acurite-0986TX-Decoder-ESP32a/Acurite_00986TX_Decoder_ESP32a.ino
      unsigned int ringIndex;
      bool fail = false;


/* ************************************************************* */
// Print the bit stream for debugging. 
// Generates a lot of chatter, normally disable this.    
#ifdef DISPLAY_BIT_TIMING

      Serial.print("syncFound = ");
      Serial.println(syncFound);
      Serial.print("changeCount = ");
      Serial.println(changeCount);

      Serial.print("syncIndex = ");
      Serial.println(syncIndex);

      Serial.print("dataIndex = ");
      Serial.println(dataIndex);

      ringIndex = (syncIndex - (SYNCPULSEEDGES-1)) % RING_BUFFER_SIZE;

      for ( int i = 0; i < (SYNCPULSECNT + DATABITSCNT); i++ )
      {
         int bit = convertTimingToBit( pulseDurations[ringIndex % RING_BUFFER_SIZE], 
                                       pulseDurations[(ringIndex + 1) % RING_BUFFER_SIZE] );

         Serial.print("bit ");
         Serial.print( i );
         Serial.print(" = ");
         Serial.print(bit);
         Serial.print(" t0 = ");
         Serial.print(pulseDurations [ringIndex % RING_BUFFER_SIZE]);
         Serial.print(" t1 = ");
         Serial.println(pulseDurations [(ringIndex + 1) % RING_BUFFER_SIZE]);

         ringIndex += 2;
      }
#endif // endif of DISPLAY_BIT_TIMING


/* ************************************************************* */
// Build a byte array with the raw data received

      fail = false;                             // reset bit decode error flag

      // clear the data bytes array
      for( int i = 0; i < DATABYTESCNT; i++ )
         { dataBytes[i] = 0; }
        
      ringIndex = (syncIndex +1 ) % RING_BUFFER_SIZE;

      for( int i = 0; i < DATABITSCNT; i++ )
      {
         int bit = convertTimingToBit ( pulseDurations[ringIndex % RING_BUFFER_SIZE], 
                                       pulseDurations[(ringIndex +1 ) % RING_BUFFER_SIZE] ); 
                                                                          
         if( bit < 0 )                 // check for a valid bit, ie: 1 or zero, -1 = error
           {  
              fail = true;
              break;                    // exit loop
           }
         else
           {
              dataBytes[i/8] |= bit << ( 7 - (i % 8));   // pack into a byte
           }        
         ringIndex += 2;
      }

#ifdef DISPLAY_DATA_BYTES

      if (fail )
        { Serial.println("Data Byte Display --> Decoding error."); }
      else
        {
          for( int i = 0; i < DATABYTESCNT; i++ )
            {
              PrintHex8 (&dataBytes[i], 1);
              Serial.print(",");
            }
          Serial.print("  ");
  
          for( int i = 0; i < DATABYTESCNT; i++ )
            {
              Serial.print(dataBytes[i], BIN);
              Serial.print(",");
            }
          Serial.print("  ");
        }

#endif  // end of DISPLAY_DATA_BYTES


/* ************************************************************* */
// lets extract data from the sensor
// all data bytes are now in dataBytes[DATABYTESCNT]
// Bits are received LSB first, so we need to reverse order of all of the bits

    for (unsigned char i=0; i <= 4; i++)  { dataBytes[i] = reverse8(dataBytes[i]); }

/* ************************************************************* */
        if (!fail)                                                // if fail, we decoded some bits wrong, so don't process this block
        {
          if ( crc8le(dataBytes, 4, 0x07, 0) == dataBytes[4] )    // if CRC8 is good... 
          {

 #ifdef VERBOSE_OUTPUT            

              Serial.print(Minute);                                 // Time stamp for display
              Serial.print(" ");    
              Serial.print("Acurite 986 sensor: 0X");
              Serial.print( dataBytes[1], HEX );
              Serial.print( dataBytes[2], HEX );
              
              // print sensor number, 1 or 2
              if ( dataBytes[3] & 0x01) 
                { Serial.print(" - 2F: "); }      
              else 
                { Serial.print(" - 1R: "); }
              
              // print battery status
              if (dataBytes[3] & 0x02) { Serial.print(" low battery " );}
              
              // print temperature
              if (dataBytes[0] >= 128) { temp =  (~dataBytes[0] & 0x7f); temp = (temp | 0x80) + 1; }
              else { temp =  dataBytes[0];}
              
              Serial.print ( temp, DEC);
              Serial.println(" F");
               
  #ifdef MyDEBUG
              Serial.print (Minute);         
              Serial.print (" Block Error Counter: ");                   // Print CRC and Block decode errors counters
              Serial.print (BlockFailCounter);
              Serial.print (", CRC Error Counter: ");
              Serial.println (CRCFailCounter);
              
  #endif    //  End of MyDEBUG
             
#endif      // VERBOSE_OUTPUT           

#if defined  (ARDUINO_ARCH_ESP32) || defined (ARDUINO_ARCH_ESP8266)

          // Send data to MQTT server
              MQTT_Send ();                           // sending MQTT messages

#endif    // end of defined  (ARDUINO_ARCH_ESP32)...
         
          }   // End of if (crc8le...
          else  
            {
              
    #ifdef MyDEBUG
              Serial.print (Minute);                                    // Print CRC8 information
              Serial.print ( " CRC: is: ");
              Serial.print ( dataBytes[4], HEX );
              Serial.print ( " Should be: ");
              Serial.println ( crc8le(dataBytes, 4, 0x07, 0), HEX);     // I know, this is a wast of time to do this again...
    #endif
              CRCFailCounter++;                                         // if CRC is bad, keep count
              }
          
        }   // End of if (!fail)...
        
        else 
          { BlockFailCounter++; }                                  // if block decode is bad, keep count
          
      received = false;
      syncFound = false;
      
      delay (250);       // this will eliminate 2nd block of data if its sent
      
      // re-enable interrupt
      attachInterrupt (MyInterrupt, interrupt_handler, CHANGE);
      
   }    // end of:  if( received == true )

}   // end of: loop



